; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-29)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at ball26 room5)
(at ball27 room5)
(at ball28 room5)
(at ball29 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 room4)
(at ball2 room4)
(at ball3 room4)
(at ball4 room4)
(at ball5 room4)
(at ball6 room4)
(at ball7 room4)
(at ball8 room4)
(at ball9 room4)
(at ball10 room4)
(at ball11 room4)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room4)
(at ball21 room4)
(at ball22 room4)
(at ball23 room4)
(at ball24 room4)
(at ball25 room4)
(at ball26 room4)
(at ball27 room4)
(at ball28 room4)
(at ball29 room4)
)
)
)

; plan
1. (pick ball3 rooma left)
   deleted: (at ball3 rooma) (free left)
   added: (carry ball3 left)
   goals met: 6 of 29
2. (pick ball2 rooma right)
   deleted: (at ball2 rooma) (free right)
   added: (carry ball2 right)
   goals met: 6 of 29
3. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 6 of 29
4. (drop ball2 room4 right)
   deleted: (carry ball2 right)
   added: (at ball2 room4) (free right)
   goals met: 7 of 29
5. (drop ball3 room4 left)
   deleted: (carry ball3 left)
   added: (at ball3 room4) (free left)
   goals met: 8 of 29
6. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 8 of 29
7. (pick ball9 roomb left)
   deleted: (at ball9 roomb) (free left)
   added: (carry ball9 left)
   goals met: 8 of 29
8. (pick ball8 roomb right)
   deleted: (at ball8 roomb) (free right)
   added: (carry ball8 right)
   goals met: 8 of 29
9. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 8 of 29
10. (drop ball8 room4 right)
   deleted: (carry ball8 right)
   added: (at ball8 room4) (free right)
   goals met: 9 of 29
11. (drop ball9 room4 left)
   deleted: (carry ball9 left)
   added: (at ball9 room4) (free left)
   goals met: 10 of 29
12. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 10 of 29
13. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 10 of 29
14. (pick ball6 roomb right)
   deleted: (at ball6 roomb) (free right)
   added: (carry ball6 right)
   goals met: 10 of 29
15. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 10 of 29
16. (drop ball6 room4 right)
   deleted: (carry ball6 right)
   added: (at ball6 room4) (free right)
   goals met: 11 of 29
17. (drop ball7 room4 left)
   deleted: (carry ball7 left)
   added: (at ball7 room4) (free left)
   goals met: 12 of 29
18. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 12 of 29
19. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 12 of 29
20. (pick ball4 roomb right)
   deleted: (at ball4 roomb) (free right)
   added: (carry ball4 right)
   goals met: 12 of 29
21. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 12 of 29
22. (drop ball4 room4 right)
   deleted: (carry ball4 right)
   added: (at ball4 room4) (free right)
   goals met: 13 of 29
23. (drop ball5 room4 left)
   deleted: (carry ball5 left)
   added: (at ball5 room4) (free left)
   goals met: 14 of 29
24. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 14 of 29
25. (pick ball10 roomb left)
   deleted: (at ball10 roomb) (free left)
   added: (carry ball10 left)
   goals met: 14 of 29
26. (move roomb room6)
   deleted: (at-robby roomb)
   added: (at-robby room6)
   goals met: 14 of 29
27. (pick ball29 room6 right)
   deleted: (at ball29 room6) (free right)
   added: (carry ball29 right)
   goals met: 14 of 29
28. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 14 of 29
29. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 14 of 29
30. (drop ball29 room4 right)
   deleted: (carry ball29 right)
   added: (at ball29 room4) (free right)
   goals met: 15 of 29
31. (drop ball10 room4 left)
   deleted: (carry ball10 left)
   added: (at ball10 room4) (free left)
   goals met: 16 of 29
32. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 16 of 29
33. (pick ball28 room5 left)
   deleted: (at ball28 room5) (free left)
   added: (carry ball28 left)
   goals met: 16 of 29
34. (pick ball27 room5 right)
   deleted: (at ball27 room5) (free right)
   added: (carry ball27 right)
   goals met: 16 of 29
35. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 16 of 29
36. (drop ball27 room4 right)
   deleted: (carry ball27 right)
   added: (at ball27 room4) (free right)
   goals met: 17 of 29
37. (drop ball28 room4 left)
   deleted: (carry ball28 left)
   added: (at ball28 room4) (free left)
   goals met: 18 of 29
38. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 18 of 29
39. (pick ball26 room5 left)
   deleted: (at ball26 room5) (free left)
   added: (carry ball26 left)
   goals met: 18 of 29
40. (pick ball25 room5 right)
   deleted: (at ball25 room5) (free right)
   added: (carry ball25 right)
   goals met: 18 of 29
41. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 18 of 29
42. (drop ball25 room4 right)
   deleted: (carry ball25 right)
   added: (at ball25 room4) (free right)
   goals met: 19 of 29
43. (drop ball26 room4 left)
   deleted: (carry ball26 left)
   added: (at ball26 room4) (free left)
   goals met: 20 of 29
44. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 20 of 29
45. (pick ball24 room5 left)
   deleted: (at ball24 room5) (free left)
   added: (carry ball24 left)
   goals met: 20 of 29
46. (pick ball23 room5 right)
   deleted: (at ball23 room5) (free right)
   added: (carry ball23 right)
   goals met: 20 of 29
47. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 20 of 29
48. (drop ball23 room4 right)
   deleted: (carry ball23 right)
   added: (at ball23 room4) (free right)
   goals met: 21 of 29
49. (drop ball24 room4 left)
   deleted: (carry ball24 left)
   added: (at ball24 room4) (free left)
   goals met: 22 of 29
50. (move room4 room5)
   deleted: (at-robby room4)
   added: (at-robby room5)
   goals met: 22 of 29
51. (pick ball22 room5 left)
   deleted: (at ball22 room5) (free left)
   added: (carry ball22 left)
   goals met: 22 of 29
52. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 22 of 29
53. (drop ball22 room4 left)
   deleted: (carry ball22 left)
   added: (at ball22 room4) (free left)
   goals met: 23 of 29
54. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 23 of 29
55. (pick ball15 room3 left)
   deleted: (at ball15 room3) (free left)
   added: (carry ball15 left)
   goals met: 23 of 29
56. (pick ball14 room3 right)
   deleted: (at ball14 room3) (free right)
   added: (carry ball14 right)
   goals met: 23 of 29
57. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 23 of 29
58. (drop ball14 room4 right)
   deleted: (carry ball14 right)
   added: (at ball14 room4) (free right)
   goals met: 24 of 29
59. (drop ball15 room4 left)
   deleted: (carry ball15 left)
   added: (at ball15 room4) (free left)
   goals met: 25 of 29
60. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 25 of 29
61. (pick ball13 room3 left)
   deleted: (at ball13 room3) (free left)
   added: (carry ball13 left)
   goals met: 25 of 29
62. (pick ball12 room3 right)
   deleted: (at ball12 room3) (free right)
   added: (carry ball12 right)
   goals met: 25 of 29
63. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 25 of 29
64. (drop ball12 room4 right)
   deleted: (carry ball12 right)
   added: (at ball12 room4) (free right)
   goals met: 26 of 29
65. (drop ball13 room4 left)
   deleted: (carry ball13 left)
   added: (at ball13 room4) (free left)
   goals met: 27 of 29
66. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 27 of 29
67. (pick ball11 room3 left)
   deleted: (at ball11 room3) (free left)
   added: (carry ball11 left)
   goals met: 27 of 29
68. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 27 of 29
69. (drop ball11 room4 left)
   deleted: (carry ball11 left)
   added: (at ball11 room4) (free left)
   goals met: 28 of 29
70. (move room4 rooma)
   deleted: (at-robby room4)
   added: (at-robby rooma)
   goals met: 28 of 29
71. (pick ball1 rooma left)
   deleted: (at ball1 rooma) (free left)
   added: (carry ball1 left)
   goals met: 28 of 29
72. (move rooma room4)
   deleted: (at-robby rooma)
   added: (at-robby room4)
   goals met: 28 of 29
73. (drop ball1 room4 left)
   deleted: (carry ball1 left)
   added: (at ball1 room4) (free left)
   goals met: 29 of 29
